namespace 包装计算
{
    public class 新包装资料
    {
        public string? 包装名称 { get; set; }
        public List<string>? 装箱产品型号 { get; set; }
        public List<string>? 装箱产品类型 { get; set; }
        public List<string>? 包材名称 { get; set; }  // 修改为列表
        public string? 系统编码 { get; set; }
        public int 装箱数量 { get; set; }
        public string? 圆盘内全部盘灯米数 { get; set; }
        public string? 圆盘内全部盘线材 { get; set; }
        public string? 半成品BOM物料码 { get; set; }
        public string? 系统尺寸 { get; set; }
        public double 总有效容积 { get; set; }
        public double 内撑纸卡容积 { get; set; }
        public double 圆形平卡容积 { get; set; }
        public double 圆垫板容积 { get; set; }
        public double 垫高纸卡容积 { get; set; }
        

        // 其他属性...
    }

    public class 新包装
    {
        private List<新包装资料> 装箱产品列表 = new List<新包装资料>
    {
        new 新包装资料
        {
            包装名称="圆盘式包装470mm圆盘-01",
            装箱产品型号 = new List<string> { "F16", "F22", "F10", "F23", "F1212" },
            装箱产品类型 = new List<string>
            {
                "F16、单层注塑端部出线、单层注塑底部出线、双层注塑端部出线、双层注塑底部出线",
                "F22、单层注塑端部出线、单层注塑侧弯侧面出线、单层注塑正弯底部出线、双层注塑端部出线、双层注塑侧弯侧面出线、双层注塑正弯底部出线",
                "F10、单层注塑端部出线、单层注塑侧面出线、双层注塑端部出线、双层注塑侧面出线",
                "F23、单层注塑端部出线、单层注塑侧弯侧面出线、单层注塑正弯底部出线、双层注塑端部出线、双层注塑侧弯侧面出线、双层注塑正弯底部出线",
                "F1212、单层注塑端部出线、单层注塑侧弯侧面出线、单层注塑正弯底部出线"
            },
            包材名称 = new List<string>
            {
                "天盒", "地盒", "加强平卡", "上圆纸板", "下圆纸板",
                "圆纸管", "内撑纸卡", "内五角平卡", "圆形平卡"
            },
            系统编码 = "1006.045137",
            装箱数量 = 1,
            系统尺寸 = "1K8K纸质",
            半成品BOM物料码 = "30.23.010101",
            总有效容积 = 1734 * 1.8,    //1
            内撑纸卡容积 = 314 * 1.8,  //2
            圆形平卡容积 = 706.5 * 1.8   //3

                //注：
                //1、线槽内可放置10米电线
                //2、产品长度米数小于6米的，请选用多条包装方式
        },

        new 新包装资料
        {
            包装名称="圆盘式包装470mm圆盘-02",
            装箱产品型号 = new List<string> { "F16", "F22", "F10", "F23", "F1212", "F15", "F21" },
            装箱产品类型 = new List<string>
            {
                "F16、单层注塑侧部出线",
                "F22、单层注塑侧弯底部出线、单层注塑正弯侧部出线、双层注塑侧弯底部出线、双层注塑正弯侧部出线",
                "F10、单层注塑底部出线、双层注塑底部出线",
                "F23、单层注塑侧弯底部出线、单层注塑正弯侧部出线、双层注塑侧弯底部出线、双层注塑正弯侧部出线",
                "F1212、单层注塑侧弯底部出线、单层注塑正弯侧部出线",
                "F15、双层注塑底部出线、多条或短条包装",
                "F21、双层注塑底部出线、多条或短条包装"
            },
            包材名称 = new List<string>
            {
                "天盒", "地盒", "加强平卡", "上圆纸板", "下圆纸板", "圆纸管",
                "内撑纸卡", "内五角平卡", "圆形平卡"
            },
            系统编码 = "1006.045143",
            装箱数量 = 1,
            系统尺寸 = "1K8K纸质",
            半成品BOM物料码 = "30.23.010104",
            总有效容积 = 1734 * 4.3,  //1
            内撑纸卡容积 = 314 * 4.3,  //2
            圆形平卡容积 = 706.5 * 4.3,   //3
            垫高纸卡容积=1734*2.5  //5
                //注：
                //1、线槽内可放置10米电线
                //2、产品长度米数小于6米的，请选用多条包装方式。
                //3.F15/F21双层底部注塑出线产品（多条或短条包装）可选用此包装。【注意：此多条包装是不需要上/下圆纸板、圆纸管、内撑纸卡、内五角平卡及全棉织带物料】
        },

        new 新包装资料
        {
            包装名称 = "圆盘式包装470mm圆盘-03",
            装箱产品型号 = new List<string> { "F16", "F22", "F10", "F23", "F1212" },
            装箱产品类型 = new List<string>
            {
                "F16、单层注塑端部出线、单层注塑底部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑底部出线、双层注塑侧部出线、（多条或短条包装）",
                "F22、单层注塑端部出线、单层注塑底部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑正弯底部出线、双层注塑侧弯侧部出线、（多条或短条包装）",
                "F10、单层注塑端部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑侧部出线、（多条或短条包装）",
                "F23、单层注塑端部出线、单层注塑底部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑底部出线、双层注塑侧部出线、（多条或短条包装）",
                "F1212、单层注塑端部出线、单层注塑底部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑底部出线、双层注塑侧部出线、（多条或短条包装）"
            },
            包材名称 = new List<string>
            {
                "天盒", "地盒", "加强平卡", "圆垫板",
            },
            系统编码 = "1006.045141",
            装箱数量 = 1,
            系统尺寸 = "K8K纸质",
            半成品BOM物料码 = "30.23.010105",
            总有效容积 = 1734 * 3.4,  //1
            圆垫板容积 = 1734*0.6*2,   //4
            // 注：
            // 1、此套包装为多条灯带或短条灯带包装使用。
            // 2、线槽内可放置10米电线
            // 3、多条灯与短条灯包装优先选用此包装。
            // 4、F22双层注塑侧弯底部出线、正弯侧出线成品/F10双层注塑底部出线成品多条或短条包装从此包装内删除。
        },
        new 新包装资料
        {
            包装名称 = "圆盘式包装470mm圆盘-04",
            装箱产品型号 = new List<string>
            {
                "F15", "F21", "F2008", "F2010", "F2012",
            },
            装箱产品类型 = new List<string>
            {
                "F15、单层注塑端部出线、单层注塑侧部出线、双层注塑端部出线、双层注塑侧部出线",
                "F21、单层注塑端部出线、单层注塑侧面出线、双层注塑端部出线、双层注塑侧部出线",
                "F2008、单层注塑端部出线、单层注塑底部出线、双层注塑端部出线、双层注塑底部出线",
                "F2010、单层注塑端部出线、单层注塑底部出线、双层注塑端部出线、双层注塑底部出线",
                "F2012、单层注塑端部出线、单层注塑底部出线、双层注塑端部出线、双层注塑底部出线"
            },
            包材名称 = new List<string>
            {
                "圆盘式天盒", "地盒", "加强平卡", "上圆纸板", "下圆纸板",
                "圆纸管", "内撑纸卡","内五角平卡", "圆形平卡",
            },
            系统编码 = "1006.045146",
            装箱数量 = 1,
            系统尺寸 = "K8K纸质",
            半成品BOM物料码 = "30.23.010109",
            总有效容积 = 1734 * 2.9,  //1
            内撑纸卡容积 = 314*2.9,  //2
            圆形平卡容积 = 706.5*2.9,  //3
            },
            

            // 其他包装资料...
        };

        public 新包装资料? 查找包装资料(string 产品型号, string 产品类型)
        {
            var 包装资料 = 装箱产品列表
                .FirstOrDefault(包装 =>
                    包装.装箱产品型号 != null && 包装.装箱产品型号.Contains(产品型号) &&
                    包装.装箱产品类型 != null && 包装.装箱产品类型.Any(类型 => 类型.Contains(产品类型)));

            return 包装资料 ?? null; // 明确返回 null，避免警告
        }

      


    }



}